controllers/CountryController.php

INSERT INTO `country` (`code`) VALUES (DEFAULT)
---
    public function actionCreate()
    {
        $model = new Country();

        if ($this->request->isPost) {


            if ($model->load($this->request->post()) && $model->save()) {

SELECT * FROM `country` WHERE `code`='IN'
---
    protected function findModel($code)
    {
        if (($model = Country::findOne(['code' => $code])) !== null) {